TAL_INT_GIT/Sample Data/BY_WMS/Shipment_Confirmation/Input/Shipment_Confirmatio_req/Shipment_Confirmatio_req

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZWM_SHIP_LOAD_OUB_IFD>
         <!--Optional:-->
         <T_CREATED>
            <!--Zero or more repetitions:-->
            <item>
               <ID></ID>
               <DOCUMENT_CATEGORY_SD></DOCUMENT_CATEGORY_SD>
               <DOCUMENT_NUMB></DOCUMENT_NUMB>
               <DOCUMENT_ITEM></DOCUMENT_ITEM>
               <QUANTITY_SALES_UOM></QUANTITY_SALES_UOM>
               <SALES_UNIT></SALES_UNIT>
               <MATERIAL></MATERIAL>
               <DOCUMENT_CATEGORY_SD_LONG></DOCUMENT_CATEGORY_SD_LONG>
               <MATERIAL_LONG></MATERIAL_LONG>
               <MATERIAL_EXTERNAL></MATERIAL_EXTERNAL>
               <MATERIAL_GUID></MATERIAL_GUID>
               <MATERIAL_VERSION></MATERIAL_VERSION>
            </item>
         </T_CREATED>
         <!--Optional:-->
         <ZSO_ITM>
            <!--Zero or more repetitions:-->
            <item>
               <SALES_ORD_NUM></SALES_ORD_NUM>
               <SALES_ORDLIN></SALES_ORDLIN>
               <PART_NUM></PART_NUM>
               <SHP_QTY></SHP_QTY>
               <BATCH></BATCH>
               <PLANT></PLANT>
               <STORAGE_LOC></STORAGE_LOC>
               <RTCUST></RTCUST>
               <STCUST></STCUST>
            </item>
         </ZSO_ITM>
      </urn:ZWM_SHIP_LOAD_OUB_IFD>
   </soapenv:Body>
</soapenv:Envelope>